Catalogs/бит_Проживающие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Проживающие</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
						<v8:Type>cfg:EnumRef.УдалитьПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрАдресПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактАдресПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформАдресПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнострАдресПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСлужебныйПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругаяИнформацияПроживающего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПрибытияДрРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГИСНМСПН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_СогласиеНаОбработкуПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.лб_ВидСогласияНаОбработкуПД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>лб_ДатаСогласияНаОбработкуПД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННЮрЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>85</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыКонтактнойИнформацииЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗапятые</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>бит_ЗаконныеПредставители</Name>
					<Comment>//bit_semenov.v_19.11.2021</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проживающий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>бит_Дети</Name>
					<Comment>//bit_semenov.v_19.11.2021</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проживающий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_Проживающие/Forms/ФормаЗаписиВоинскийУчетУправляемая/Ext/Form/Module.bsl
#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	Отбор          = Новый Структура;
	
	Отбор.Вставить("ФизЛицо", ФизЛицо);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.бит_ВоинскийУчет.Форма.ФормаСпискаУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИзменения(Команда)
	
	ЗаписатьИзменения();
	Закрыть();
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента", "ВоинскийУчет"), ФизЛицо);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменения()
	
	ЗаписьИзНабораНабор = ДанныеФормыВЗначение(НаборЗаписей, Тип("РегистрСведенийНаборЗаписей.бит_ВоинскийУчет"));
	
	// БИТ_ЖКХ 28.12.2015 10:41:20 Начало правки... 
	//Если Период <> ПериодПриОткрытии Тогда 
	//	ЗаписьИзНабора = ЗаписьИзНабораНабор.Добавить();
	//	ЗаписьИзНабора.ФизЛицо = ФизЛицо;
	//Иначе
	//	ЗаписьИзНабора = ЗаписьИзНабораНабор[0];
	//КонецЕсли;
	
	ЗаписьИзНабора = ЗаписьИзНабораНабор[0];
	// БИТ_ЖКХ 28.12.2015 10:41:16 Конец правки.
	
    // Если что-то поменяли тогда запишем. 
	Если ВоенкоматПриОткрытии <> Военкомат ИЛИ
		ВУСПриОткрытии <> ВУС ИЛИ
		ГодностьПриОткрытии <> Годность ИЛИ
		ЗваниеПриОткрытии <> Звание ИЛИ
		НаличиеМобпредписанияПриОткрытии <> НаличиеМобпредписания ИЛИ
		ОтношениеКВоинскойОбязанностиПриОткрытии <> ОтношениеКВоинскойОбязанности ИЛИ
		Период <> ПериодПриОткрытии ИЛИ
		ОтношениеКВоинскомуУчетуПриОткрытии <> ОтношениеКВоинскомуУчету ИЛИ
		ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчетаПриОткрытии <> ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета ИЛИ
		КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчетаПриОткрытии <> КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета ИЛИ
		КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчетаПриОткрытии <> КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета Тогда
	
		ЗаписьИзНабора.Период  						 = Период;
		ЗаписьИзНабора.Военкомат					 = Военкомат;
		ЗаписьИзНабора.ВУС							 = ВУС;
		ЗаписьИзНабора.Годность						 = Годность;
		ЗаписьИзНабора.Звание 						 = Звание;
		ЗаписьИзНабора.НаличиеМобпредписания		 = НаличиеМобпредписания;
		ЗаписьИзНабора.ОтношениеКВоинскойОбязанности = ОтношениеКВоинскойОбязанности;
		ЗаписьИзНабора.ОтношениеКВоинскомуУчету		 = ОтношениеКВоинскомуУчету;
		ЗаписьИзНабора.КатегорияЗапаса				 = КатегорияЗапаса;
		ЗаписьИзНабора.Состав						 = Состав;
		ЗаписьИзНабора.НомерКомандыПартии			 = НомерКомандыПартии;
		ЗаписьИзНабора.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета = ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета;
		ЗаписьИзНабора.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета    = КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
		ЗаписьИзНабора.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета      = КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
		
		Попытка
			// БИТ_ЖКХ 28.12.2015 10:43:01 Начало правки... 
			ЗаписьИзНабораНабор.Отбор.Физлицо.Использование	= Истина;
			ЗаписьИзНабораНабор.Отбор.Физлицо.Значение		= ФизЛицо;
			ЗаписьИзНабораНабор.Отбор.Период.Использование	= Истина;
			ЗаписьИзНабораНабор.Отбор.Период.Значение		= Период;
			// БИТ_ЖКХ 28.12.2015 10:43:03 Конец правки. 
		    ЗаписьИзНабораНабор.Записать(Истина);
		Исключение
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		КонецПопытки;
		
		ЗначениеВДанныеФормы(ЗаписьИзНабораНабор, НаборЗаписей);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаборЗаписей.Очистить();
	
	Если Параметры.Свойство("Ключ") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	бит_ВоинскийУчетСрезПоследних.Период КАК Период,
	    |	бит_ВоинскийУчетСрезПоследних.ФизЛицо КАК ФизЛицо,
	    |	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскойОбязанности,
	    |	бит_ВоинскийУчетСрезПоследних.ОтношениеКВоинскомуУчету,
	    |	бит_ВоинскийУчетСрезПоследних.КатегорияЗапаса,
	    |	бит_ВоинскийУчетСрезПоследних.Звание,
	    |	бит_ВоинскийУчетСрезПоследних.Состав,
	    |	бит_ВоинскийУчетСрезПоследних.ВУС,
	    |	бит_ВоинскийУчетСрезПоследних.Годность,
	    |	бит_ВоинскийУчетСрезПоследних.Военкомат,
	    |	бит_ВоинскийУчетСрезПоследних.НаличиеМобпредписания,
	    |	бит_ВоинскийУчетСрезПоследних.НомерКомандыПартии,
	    |	бит_ВоинскийУчетСрезПоследних.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	    |	бит_ВоинскийУчетСрезПоследних.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета,
	    |	бит_ВоинскийУчетСрезПоследних.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета
	    |ИЗ
	    |	РегистрСведений.бит_ВоинскийУчет.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК бит_ВоинскийУчетСрезПоследних");
		
		Запрос.УстановитьПараметр("ФизЛицо", Параметры.Ключ.ФизЛицо);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			
		КонецЕсли;

	КонецЕсли;

	Если НаборЗаписей.Количество() = 0 Тогда
		
		НаборЗаписей.Добавить();
		
		ЗаписьИзНабора = НаборЗаписей[0];
		
		Если Параметры.Свойство("ЗаполнитьИзСправочникаПроживающие") Тогда
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("ФизЛицо") Тогда
				
				ЗаписьИзНабора.ФизЛицо = Параметры.ЗаполнитьИзСправочникаПроживающие.ФизЛицо;
				
			КонецЕсли;
			
			Если Параметры.ЗаполнитьИзСправочникаПроживающие.Свойство("Период") Тогда
				
				ЗаписьИзНабора.Период = Параметры.ЗаполнитьИзСправочникаПроживающие.Период;
				
			КонецЕсли;
		
		КонецЕсли;

	КонецЕсли;
	
	ЗаписьИзНабора = НаборЗаписей[0];
	
	Период  = ?(НЕ ЗначениеЗаполнено(ЗаписьИзНабора.Период), '19000101', ЗаписьИзНабора.Период);
	
	Военкомат						                   = ЗаписьИзНабора.Военкомат;
	ВУС								                   = ЗаписьИзНабора.ВУС;
	Годность						                   = ЗаписьИзНабора.Годность;
	Звание							                   = ЗаписьИзНабора.Звание;
	НаличиеМобпредписания			                   = ЗаписьИзНабора.НаличиеМобпредписания;
	ОтношениеКВоинскойОбязанности	                   = ЗаписьИзНабора.ОтношениеКВоинскойОбязанности;
	ОтношениеКВоинскомуУчету		                   = ЗаписьИзНабора.ОтношениеКВоинскомуУчету;
	Период 							                   = ?(ЗначениеЗаполнено(ЗаписьИзНабора.Период), ЗаписьИзНабора.Период, '19000101');
	КатегорияЗапаса					                   = ЗаписьИзНабора.КатегорияЗапаса;
	Состав							                   = ЗаписьИзНабора.Состав;
	НомерКомандыПартии				                   = ЗаписьИзНабора.НомерКомандыПартии;
	ФизЛицо							                   = ЗаписьИзНабора.Физлицо;
	ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета = ЗаписьИзНабора.ОтметкаОПриемеНаВоинскийУчетИСнятииСВоинскогоУчета;
	КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета    = ЗаписьИзНабора.КогдаПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
	КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета      = ЗаписьИзНабора.КемПринятНаВоинскийУчетИлиСнятСВоинскогоУчета;
	
	Если ФизЛицо = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка") Тогда
		
		Элементы.История.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
